Autodesk.Revit.UI.SetupEnergySimulationDialog.Show
Shows the SetupEnergySimulationDialog to the user as a modal dialog.
Returns:
One of the Autodesk.Revit.UI.SetupEnergySimulationDialogResult values.
Since:
2016

Autodesk.Revit.UI.SetupEnergySimulationDialog.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.SetupEnergySimulationDialog.RunName
The name of the analysis run that was supplied by the user.
Remarks:
This value is only valid after Autodesk.Revit.UI.SetupEnergySimulationDialog.Show has been called.
Since:
2016

Autodesk.Revit.UI.SetupEnergySimulationDialog.ProjectId
The identifier of the project (on the Green Building Studio server) that was selected by the user.
Remarks:
This value is only valid after Autodesk.Revit.UI.SetupEnergySimulationDialog.Show has been called.
A negative value indicates that no project was selected.
Since:
2016

Autodesk.Revit.UI.SetupEnergySimulationDialog.ProjectName
The project name (representing a project on the Green Building Studio server) selected or supplied by the user.
Remarks:
This value is only valid after Autodesk.Revit.UI.SetupEnergySimulationDialog.Show has been called.
Since:
2016

Autodesk.Revit.UI.SetupEnergySimulationDialog.#ctor
Constructs a new instance of the SetupEnergySimulationDialog class.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The user has not signed in to their Autodesk account.
Since:
2016

Autodesk.Revit.UI.SetupEnergySimulationDialog
The Revit dialog which typically precedes invocation of an Energy Simulation run on the Green Building Studio server.
Remarks:
Add-ins can invoke this dialog to collect the name and id of a Green Building Studio project and the name of an analysis run from the user.
When the user chooses these values and opts to Continue, control returns the add-in to use the values the user has selected.
No Green Building Studio run is automatically invoked by the user's actions in the dialog when it is prompted by the add-in.
This class can be instantiated only when the user is logged in to their Autodesk account.
Since:
2016